{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.3", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 416, 416, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "leaky_re_lu", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d", "inbound_nodes": [[["leaky_re_lu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_3", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_4", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "max_pooling2d_5", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_7", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_10", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_9", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "ResizeNearestNeighbor", "trainable": true, "dtype": "float32", "node_def": {"name": "ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["leaky_re_lu_9/LeakyRelu", "ResizeNearestNeighbor/size"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [26, 26]}}, "name": "tf_op_layer_ResizeNearestNeighbor", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat", "trainable": true, "dtype": "float32", "node_def": {"name": "concat", "op": "ConcatV2", "input": ["ResizeNearestNeighbor", "leaky_re_lu_4/LeakyRelu", "concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": -1}}, "name": "tf_op_layer_concat", "inbound_nodes": [[["tf_op_layer_ResizeNearestNeighbor", 0, 0, {}], ["leaky_re_lu_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_11", "inbound_nodes": [[["tf_op_layer_concat", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_8", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_10", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "leaky_re_lu_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "dtype": "float32", "filters": 30, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_12", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "dtype": "float32", "filters": 30, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_9", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Shape", "trainable": true, "dtype": "float32", "node_def": {"name": "Shape", "op": "Shape", "input": ["conv2d_12/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Shape", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Shape_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Shape_1", "op": "Shape", "input": ["conv2d_9/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Shape_1", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_1", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_1", "op": "StridedSlice", "input": ["Shape", "strided_slice_1/begin", "strided_slice_1/end", "strided_slice_1/strides"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, "constants": {"1": [1], "2": [2], "3": [1]}}, "name": "tf_op_layer_strided_slice_1", "inbound_nodes": [[["tf_op_layer_Shape", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_3", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_3", "op": "StridedSlice", "input": ["Shape_1", "strided_slice_3/begin", "strided_slice_3/end", "strided_slice_3/strides"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, "constants": {"1": [1], "2": [2], "3": [1]}}, "name": "tf_op_layer_strided_slice_3", "inbound_nodes": [[["tf_op_layer_Shape_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Range", "trainable": true, "dtype": "float32", "node_def": {"name": "Range", "op": "Range", "input": ["Range/start", "strided_slice_1", "Range/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, "constants": {"0": 0, "2": 1}}, "name": "tf_op_layer_Range", "inbound_nodes": [[["tf_op_layer_strided_slice_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Range_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Range_1", "op": "Range", "input": ["Range_1/start", "strided_slice_1", "Range_1/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, "constants": {"0": 0, "2": 1}}, "name": "tf_op_layer_Range_1", "inbound_nodes": [[["tf_op_layer_strided_slice_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Range_2", "trainable": true, "dtype": "float32", "node_def": {"name": "Range_2", "op": "Range", "input": ["Range_2/start", "strided_slice_3", "Range_2/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, "constants": {"0": 0, "2": 1}}, "name": "tf_op_layer_Range_2", "inbound_nodes": [[["tf_op_layer_strided_slice_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Range_3", "trainable": true, "dtype": "float32", "node_def": {"name": "Range_3", "op": "Range", "input": ["Range_3/start", "strided_slice_3", "Range_3/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, "constants": {"0": 0, "2": 1}}, "name": "tf_op_layer_Range_3", "inbound_nodes": [[["tf_op_layer_strided_slice_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Size_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Size_1", "op": "Size", "input": ["Range_1"], "attr": {"T": {"type": "DT_INT32"}, "out_type": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Size_1", "inbound_nodes": [[["tf_op_layer_Range_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Size", "trainable": true, "dtype": "float32", "node_def": {"name": "Size", "op": "Size", "input": ["Range"], "attr": {"T": {"type": "DT_INT32"}, "out_type": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Size", "inbound_nodes": [[["tf_op_layer_Range", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Size_3", "trainable": true, "dtype": "float32", "node_def": {"name": "Size_3", "op": "Size", "input": ["Range_3"], "attr": {"T": {"type": "DT_INT32"}, "out_type": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Size_3", "inbound_nodes": [[["tf_op_layer_Range_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Size_2", "trainable": true, "dtype": "float32", "node_def": {"name": "Size_2", "op": "Size", "input": ["Range_2"], "attr": {"T": {"type": "DT_INT32"}, "out_type": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Size_2", "inbound_nodes": [[["tf_op_layer_Range_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_1", "op": "Reshape", "input": ["Range", "Reshape_1/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, "constants": {"1": [-1, 1]}}, "name": "tf_op_layer_Reshape_1", "inbound_nodes": [[["tf_op_layer_Range", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "packed", "trainable": true, "dtype": "float32", "node_def": {"name": "packed", "op": "Pack", "input": ["Size_1", "Size"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, "constants": {}}, "name": "tf_op_layer_packed", "inbound_nodes": [[["tf_op_layer_Size_1", 0, 0, {}], ["tf_op_layer_Size", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_2", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_2", "op": "Reshape", "input": ["Range_1", "Reshape_2/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, "constants": {"1": [1, -1]}}, "name": "tf_op_layer_Reshape_2", "inbound_nodes": [[["tf_op_layer_Range_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_6", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_6", "op": "Reshape", "input": ["Range_2", "Reshape_6/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, "constants": {"1": [-1, 1]}}, "name": "tf_op_layer_Reshape_6", "inbound_nodes": [[["tf_op_layer_Range_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "packed_1", "trainable": true, "dtype": "float32", "node_def": {"name": "packed_1", "op": "Pack", "input": ["Size_3", "Size_2"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, "constants": {}}, "name": "tf_op_layer_packed_1", "inbound_nodes": [[["tf_op_layer_Size_3", 0, 0, {}], ["tf_op_layer_Size_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_7", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_7", "op": "Reshape", "input": ["Range_3", "Reshape_7/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, "constants": {"1": [1, -1]}}, "name": "tf_op_layer_Reshape_7", "inbound_nodes": [[["tf_op_layer_Range_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_3", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_3", "op": "Reshape", "input": ["Reshape_1", "Reshape_3/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, "constants": {"1": [1, -1]}}, "name": "tf_op_layer_Reshape_3", "inbound_nodes": [[["tf_op_layer_Reshape_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Fill", "trainable": true, "dtype": "float32", "node_def": {"name": "Fill", "op": "Fill", "input": ["packed", "Fill/value"], "attr": {"T": {"type": "DT_INT32"}, "index_type": {"type": "DT_INT32"}}}, "constants": {"1": 1}}, "name": "tf_op_layer_Fill", "inbound_nodes": [[["tf_op_layer_packed", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_4", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_4", "op": "Reshape", "input": ["Reshape_2", "Reshape_4/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, "constants": {"1": [-1, 1]}}, "name": "tf_op_layer_Reshape_4", "inbound_nodes": [[["tf_op_layer_Reshape_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_8", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_8", "op": "Reshape", "input": ["Reshape_6", "Reshape_8/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, "constants": {"1": [1, -1]}}, "name": "tf_op_layer_Reshape_8", "inbound_nodes": [[["tf_op_layer_Reshape_6", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Fill_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Fill_1", "op": "Fill", "input": ["packed_1", "Fill_1/value"], "attr": {"T": {"type": "DT_INT32"}, "index_type": {"type": "DT_INT32"}}}, "constants": {"1": 1}}, "name": "tf_op_layer_Fill_1", "inbound_nodes": [[["tf_op_layer_packed_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_9", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_9", "op": "Reshape", "input": ["Reshape_7", "Reshape_9/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, "constants": {"1": [-1, 1]}}, "name": "tf_op_layer_Reshape_9", "inbound_nodes": [[["tf_op_layer_Reshape_7", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul", "op": "Mul", "input": ["Reshape_3", "Fill"], "attr": {"T": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Mul", "inbound_nodes": [[["tf_op_layer_Reshape_3", 0, 0, {}], ["tf_op_layer_Fill", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_1", "op": "Mul", "input": ["Reshape_4", "Fill"], "attr": {"T": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Mul_1", "inbound_nodes": [[["tf_op_layer_Reshape_4", 0, 0, {}], ["tf_op_layer_Fill", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_5", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_5", "op": "Mul", "input": ["Reshape_8", "Fill_1"], "attr": {"T": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Mul_5", "inbound_nodes": [[["tf_op_layer_Reshape_8", 0, 0, {}], ["tf_op_layer_Fill_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_6", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_6", "op": "Mul", "input": ["Reshape_9", "Fill_1"], "attr": {"T": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Mul_6", "inbound_nodes": [[["tf_op_layer_Reshape_9", 0, 0, {}], ["tf_op_layer_Fill_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice", "op": "StridedSlice", "input": ["Shape", "strided_slice/begin", "strided_slice/end", "strided_slice/strides"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, "constants": {"1": [0], "2": [1], "3": [1]}}, "name": "tf_op_layer_strided_slice", "inbound_nodes": [[["tf_op_layer_Shape", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "stack", "trainable": true, "dtype": "float32", "node_def": {"name": "stack", "op": "Pack", "input": ["Mul", "Mul_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "-1"}, "N": {"i": "2"}}}, "constants": {}}, "name": "tf_op_layer_stack", "inbound_nodes": [[["tf_op_layer_Mul", 0, 0, {}], ["tf_op_layer_Mul_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_2", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_2", "op": "StridedSlice", "input": ["Shape_1", "strided_slice_2/begin", "strided_slice_2/end", "strided_slice_2/strides"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, "constants": {"1": [0], "2": [1], "3": [1]}}, "name": "tf_op_layer_strided_slice_2", "inbound_nodes": [[["tf_op_layer_Shape_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "stack_1", "trainable": true, "dtype": "float32", "node_def": {"name": "stack_1", "op": "Pack", "input": ["Mul_5", "Mul_6"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "-1"}, "N": {"i": "2"}}}, "constants": {}}, "name": "tf_op_layer_stack_1", "inbound_nodes": [[["tf_op_layer_Mul_5", 0, 0, {}], ["tf_op_layer_Mul_6", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape/shape", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape/shape", "op": "Pack", "input": ["strided_slice", "strided_slice_1", "strided_slice_1", "Reshape/shape/3", "Reshape/shape/4"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, "constants": {"3": 3, "4": 10}}, "name": "tf_op_layer_Reshape/shape", "inbound_nodes": [[["tf_op_layer_strided_slice", 0, 0, {}], ["tf_op_layer_strided_slice_1", 0, 0, {}], ["tf_op_layer_strided_slice_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "ExpandDims", "trainable": true, "dtype": "float32", "node_def": {"name": "ExpandDims", "op": "ExpandDims", "input": ["stack", "ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, "constants": {"1": 2}}, "name": "tf_op_layer_ExpandDims", "inbound_nodes": [[["tf_op_layer_stack", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_5/shape", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_5/shape", "op": "Pack", "input": ["strided_slice_2", "strided_slice_3", "strided_slice_3", "Reshape_5/shape/3", "Reshape_5/shape/4"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, "constants": {"3": 3, "4": 10}}, "name": "tf_op_layer_Reshape_5/shape", "inbound_nodes": [[["tf_op_layer_strided_slice_2", 0, 0, {}], ["tf_op_layer_strided_slice_3", 0, 0, {}], ["tf_op_layer_strided_slice_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "ExpandDims_2", "trainable": true, "dtype": "float32", "node_def": {"name": "ExpandDims_2", "op": "ExpandDims", "input": ["stack_1", "ExpandDims_2/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, "constants": {"1": 2}}, "name": "tf_op_layer_ExpandDims_2", "inbound_nodes": [[["tf_op_layer_stack_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape", "op": "Reshape", "input": ["conv2d_12/BiasAdd", "Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Reshape", "inbound_nodes": [[["conv2d_12", 0, 0, {}], ["tf_op_layer_Reshape/shape", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "ExpandDims_1", "trainable": true, "dtype": "float32", "node_def": {"name": "ExpandDims_1", "op": "ExpandDims", "input": ["ExpandDims", "ExpandDims_1/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, "constants": {"1": 0}}, "name": "tf_op_layer_ExpandDims_1", "inbound_nodes": [[["tf_op_layer_ExpandDims", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tile/multiples", "trainable": true, "dtype": "float32", "node_def": {"name": "Tile/multiples", "op": "Pack", "input": ["strided_slice", "Tile/multiples/1", "Tile/multiples/2", "Tile/multiples/3", "Tile/multiples/4"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, "constants": {"1": 1, "2": 1, "3": 3, "4": 1}}, "name": "tf_op_layer_Tile/multiples", "inbound_nodes": [[["tf_op_layer_strided_slice", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_5", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_5", "op": "Reshape", "input": ["conv2d_9/BiasAdd", "Reshape_5/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Reshape_5", "inbound_nodes": [[["conv2d_9", 0, 0, {}], ["tf_op_layer_Reshape_5/shape", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "ExpandDims_3", "trainable": true, "dtype": "float32", "node_def": {"name": "ExpandDims_3", "op": "ExpandDims", "input": ["ExpandDims_2", "ExpandDims_3/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, "constants": {"1": 0}}, "name": "tf_op_layer_ExpandDims_3", "inbound_nodes": [[["tf_op_layer_ExpandDims_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tile_1/multiples", "trainable": true, "dtype": "float32", "node_def": {"name": "Tile_1/multiples", "op": "Pack", "input": ["strided_slice_2", "Tile_1/multiples/1", "Tile_1/multiples/2", "Tile_1/multiples/3", "Tile_1/multiples/4"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, "constants": {"1": 1, "2": 1, "3": 3, "4": 1}}, "name": "tf_op_layer_Tile_1/multiples", "inbound_nodes": [[["tf_op_layer_strided_slice_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "split", "trainable": true, "dtype": "float32", "node_def": {"name": "split", "op": "SplitV", "input": ["Reshape", "split/size_splits", "split/split_dim"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}, "Tlen": {"type": "DT_INT32"}}}, "constants": {"1": [2, 2, 1, 5], "2": -1}}, "name": "tf_op_layer_split", "inbound_nodes": [[["tf_op_layer_Reshape", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tile", "trainable": true, "dtype": "float32", "node_def": {"name": "Tile", "op": "Tile", "input": ["ExpandDims_1", "Tile/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Tile", "inbound_nodes": [[["tf_op_layer_ExpandDims_1", 0, 0, {}], ["tf_op_layer_Tile/multiples", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "split_1", "trainable": true, "dtype": "float32", "node_def": {"name": "split_1", "op": "SplitV", "input": ["Reshape_5", "split_1/size_splits", "split_1/split_dim"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}, "Tlen": {"type": "DT_INT32"}}}, "constants": {"1": [2, 2, 1, 5], "2": -1}}, "name": "tf_op_layer_split_1", "inbound_nodes": [[["tf_op_layer_Reshape_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tile_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Tile_1", "op": "Tile", "input": ["ExpandDims_3", "Tile_1/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Tile_1", "inbound_nodes": [[["tf_op_layer_ExpandDims_3", 0, 0, {}], ["tf_op_layer_Tile_1/multiples", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid", "op": "Sigmoid", "input": ["split"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid", "inbound_nodes": [[["tf_op_layer_split", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Cast", "trainable": true, "dtype": "float32", "node_def": {"name": "Cast", "op": "Cast", "input": ["Tile"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Cast", "inbound_nodes": [[["tf_op_layer_Tile", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Exp", "trainable": true, "dtype": "float32", "node_def": {"name": "Exp", "op": "Exp", "input": ["split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Exp", "inbound_nodes": [[["tf_op_layer_split", 0, 1, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_3", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_3", "op": "Sigmoid", "input": ["split_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_3", "inbound_nodes": [[["tf_op_layer_split_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Cast_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Cast_1", "op": "Cast", "input": ["Tile_1"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Cast_1", "inbound_nodes": [[["tf_op_layer_Tile_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Exp_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Exp_1", "op": "Exp", "input": ["split_1:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Exp_1", "inbound_nodes": [[["tf_op_layer_split_1", 0, 1, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2", "op": "AddV2", "input": ["Sigmoid", "Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2", "inbound_nodes": [[["tf_op_layer_Sigmoid", 0, 0, {}], ["tf_op_layer_Cast", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_3", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_3", "op": "Mul", "input": ["Exp", "Mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [[0.625, 0.875], [1.4375, 1.6875], [2.3125, 3.625]]}}, "name": "tf_op_layer_Mul_3", "inbound_nodes": [[["tf_op_layer_Exp", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_1", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_1", "op": "AddV2", "input": ["Sigmoid_3", "Cast_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_1", "inbound_nodes": [[["tf_op_layer_Sigmoid_3", 0, 0, {}], ["tf_op_layer_Cast_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_8", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_8", "op": "Mul", "input": ["Exp_1", "Mul_8/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [[2.53125, 2.5625], [4.21875, 5.28125], [10.75, 9.96875]]}}, "name": "tf_op_layer_Mul_8", "inbound_nodes": [[["tf_op_layer_Exp_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_2", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_2", "op": "Mul", "input": ["AddV2", "Mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 16.0}}, "name": "tf_op_layer_Mul_2", "inbound_nodes": [[["tf_op_layer_AddV2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_4", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_4", "op": "Mul", "input": ["Mul_3", "Mul_4/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 16.0}}, "name": "tf_op_layer_Mul_4", "inbound_nodes": [[["tf_op_layer_Mul_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_7", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_7", "op": "Mul", "input": ["AddV2_1", "Mul_7/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 32.0}}, "name": "tf_op_layer_Mul_7", "inbound_nodes": [[["tf_op_layer_AddV2_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_9", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_9", "op": "Mul", "input": ["Mul_8", "Mul_9/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 32.0}}, "name": "tf_op_layer_Mul_9", "inbound_nodes": [[["tf_op_layer_Mul_8", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_1", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_1", "op": "ConcatV2", "input": ["Mul_2", "Mul_4", "concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": -1}}, "name": "tf_op_layer_concat_1", "inbound_nodes": [[["tf_op_layer_Mul_2", 0, 0, {}], ["tf_op_layer_Mul_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_1", "op": "Sigmoid", "input": ["split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_1", "inbound_nodes": [[["tf_op_layer_split", 0, 2, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_2", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_2", "op": "Sigmoid", "input": ["split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_2", "inbound_nodes": [[["tf_op_layer_split", 0, 3, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_3", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_3", "op": "ConcatV2", "input": ["Mul_7", "Mul_9", "concat_3/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": -1}}, "name": "tf_op_layer_concat_3", "inbound_nodes": [[["tf_op_layer_Mul_7", 0, 0, {}], ["tf_op_layer_Mul_9", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_4", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_4", "op": "Sigmoid", "input": ["split_1:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_4", "inbound_nodes": [[["tf_op_layer_split_1", 0, 2, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sigmoid_5", "trainable": true, "dtype": "float32", "node_def": {"name": "Sigmoid_5", "op": "Sigmoid", "input": ["split_1:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sigmoid_5", "inbound_nodes": [[["tf_op_layer_split_1", 0, 3, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_2", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_2", "op": "ConcatV2", "input": ["concat_1", "Sigmoid_1", "Sigmoid_2", "concat_2/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "3"}}}, "constants": {"3": -1}}, "name": "tf_op_layer_concat_2", "inbound_nodes": [[["tf_op_layer_concat_1", 0, 0, {}], ["tf_op_layer_Sigmoid_1", 0, 0, {}], ["tf_op_layer_Sigmoid_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_4", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_4", "op": "ConcatV2", "input": ["concat_3", "Sigmoid_4", "Sigmoid_5", "concat_4/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "3"}}}, "constants": {"3": -1}}, "name": "tf_op_layer_concat_4", "inbound_nodes": [[["tf_op_layer_concat_3", 0, 0, {}], ["tf_op_layer_Sigmoid_4", 0, 0, {}], ["tf_op_layer_Sigmoid_5", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["tf_op_layer_concat_2", 0, 0], ["tf_op_layer_concat_4", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of9.bin", "group1-shard2of9.bin", "group1-shard3of9.bin", "group1-shard4of9.bin", "group1-shard5of9.bin", "group1-shard6of9.bin", "group1-shard7of9.bin", "group1-shard8of9.bin", "group1-shard9of9.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_1/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [32], "dtype": "float32"}, 