{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v2.8.3", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "416"}, {"size": "416"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}, {"size": "10"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_3/Reshape_3/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_4/Reshape_4/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Range_1/Range_1/start", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Range_1/Range_1/delta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Range/Range/start", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Range/Range/delta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Fill/Fill/value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_ExpandDims/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_ExpandDims_1/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Tile/multiples/Tile/multiples/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Tile/multiples/Tile/multiples/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Tile/multiples/Tile/multiples/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Tile/multiples/Tile/multiples/4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_2/Mul_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_3/Mul_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice/strides", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_ResizeNearestNeighbor/ResizeNearestNeighbor/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_concat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_56", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "30"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_57", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1/strides", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape/shape/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape/shape/Reshape/shape/4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_split/split/size_splits", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_split/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_concat_2/concat_2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_8/Reshape_8/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_9/Reshape_9/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Range_3/Range_3/start", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Range_3/Range_3/delta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Range_2/Range_2/start", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Range_2/Range_2/delta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Fill_1/Fill_1/value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_ExpandDims_2/ExpandDims_2/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_ExpandDims_3/ExpandDims_3/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Tile_1/multiples/Tile_1/multiples/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Tile_1/multiples/Tile_1/multiples/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Tile_1/multiples/Tile_1/multiples/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Tile_1/multiples/Tile_1/multiples/4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_7/Mul_7/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_8/Mul_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2/strides", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_54", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "30"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_55", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3/strides", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_5/shape/Reshape_5/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_5/shape/Reshape_5/shape/4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_split_1/split_1/size_splits", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_split_1/split_1/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_concat_4/concat_4/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "416"}, {"size": "416"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_4/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_4/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_5/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_5/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_6/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_6/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_7/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_7/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_10/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_10/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_8/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_8/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_11/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_11/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["input_1", "StatefulPartitionedCall/functional_1/conv2d/Conv2D_weights", "StatefulPartitionedCall/functional_1/conv2d/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/leaky_re_lu/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_1/batch_normalization/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/functional_1/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/functional_1/leaky_re_lu/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_1/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/max_pooling2d/MaxPool", "StatefulPartitionedCall/functional_1/conv2d_1/Conv2D_weights", "StatefulPartitionedCall/functional_1/conv2d_1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/leaky_re_lu_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_1/batch_normalization_1/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/functional_1/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/functional_1/leaky_re_lu_1/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_2/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/functional_1/conv2d_2/Conv2D_weights", "StatefulPartitionedCall/functional_1/conv2d_2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/leaky_re_lu_2/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_1/batch_normalization_2/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/functional_1/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/functional_1/leaky_re_lu_2/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_3/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/functional_1/conv2d_3/Conv2D_weights", "StatefulPartitionedCall/functional_1/conv2d_3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/leaky_re_lu_3/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_1/batch_normalization_3/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/functional_1/max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/functional_1/leaky_re_lu_3/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_4/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/max_pooling2d_3/MaxPool", "StatefulPartitionedCall/functional_1/conv2d_4/Conv2D_weights", "StatefulPartitionedCall/functional_1/conv2d_4/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/leaky_re_lu_4/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_1/batch_normalization_4/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/functional_1/max_pooling2d_4/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/functional_1/leaky_re_lu_4/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_5/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/max_pooling2d_4/MaxPool", "StatefulPartitionedCall/functional_1/conv2d_5/Conv2D_weights", "StatefulPartitionedCall/functional_1/conv2d_5/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/leaky_re_lu_5/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_1/batch_normalization_5/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/functional_1/max_pooling2d_5/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/functional_1/leaky_re_lu_5/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_6/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/max_pooling2d_5/MaxPool", "StatefulPartitionedCall/functional_1/conv2d_6/Conv2D_weights", "StatefulPartitionedCall/functional_1/conv2d_6/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/leaky_re_lu_6/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_1/batch_normalization_6/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_7/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/leaky_re_lu_6/LeakyRelu", "StatefulPartitionedCall/functional_1/conv2d_7/Conv2D_weights", "StatefulPartitionedCall/functional_1/conv2d_7/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/leaky_re_lu_7/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_1/batch_normalization_7/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_9/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/leaky_re_lu_7/LeakyRelu", "StatefulPartitionedCall/functional_1/conv2d_10/Conv2D_weights", "StatefulPartitionedCall/functional_1/conv2d_10/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_8/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/leaky_re_lu_7/LeakyRelu", "StatefulPartitionedCall/functional_1/conv2d_8/Conv2D_weights", "StatefulPartitionedCall/functional_1/conv2d_8/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/leaky_re_lu_9/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_1/batch_normalization_9/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/functional_1/leaky_re_lu_8/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_1/batch_normalization_8/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_ResizeNearestNeighbor/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/functional_1/leaky_re_lu_9/LeakyRelu", "StatefulPartitionedCall/functional_1/tf_op_layer_ResizeNearestNeighbor/ResizeNearestNeighbor/size"], "attr": {"_cloned": {"b": true}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_9/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/leaky_re_lu_8/LeakyRelu", "unknown_54", "unknown_55"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_concat/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_ResizeNearestNeighbor/ResizeNearestNeighbor", "StatefulPartitionedCall/functional_1/leaky_re_lu_4/LeakyRelu", "StatefulPartitionedCall/functional_1/tf_op_layer_concat/concat/axis"], "attr": {"_cloned": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Shape_1/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/functional_1/conv2d_9/BiasAdd"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/batch_normalization_10/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_concat/concat", "StatefulPartitionedCall/functional_1/conv2d_11/Conv2D_weights", "StatefulPartitionedCall/functional_1/conv2d_11/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Shape_1/Shape_1", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2/begin", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2/end", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2/strides"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Shape_1/Shape_1", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3/begin", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3/end", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3/strides"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/leaky_re_lu_10/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_1/batch_normalization_10/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Tile_1/multiples/Tile_1/multiples", "op": "Pack", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2", "StatefulPartitionedCall/functional_1/tf_op_layer_Tile_1/multiples/Tile_1/multiples/1", "StatefulPartitionedCall/functional_1/tf_op_layer_Tile_1/multiples/Tile_1/multiples/2", "StatefulPartitionedCall/functional_1/tf_op_layer_Tile_1/multiples/Tile_1/multiples/3", "StatefulPartitionedCall/functional_1/tf_op_layer_Tile_1/multiples/Tile_1/multiples/4"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Range_3/Range_3", "op": "Range", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Range_3/Range_3/start", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3", "StatefulPartitionedCall/functional_1/tf_op_layer_Range_3/Range_3/delta"], "attr": {"_cloned": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Range_2/Range_2", "op": "Range", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Range_2/Range_2/start", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3", "StatefulPartitionedCall/functional_1/tf_op_layer_Range_2/Range_2/delta"], "attr": {"_cloned": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_5/shape/Reshape_5/shape", "op": "Pack", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3", "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_5/shape/Reshape_5/shape/3", "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_5/shape/Reshape_5/shape/4"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_12/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/leaky_re_lu_10/LeakyRelu", "unknown_56", "unknown_57"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_9/Reshape_9", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Range_3/Range_3", "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_9/Reshape_9/shape"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Size_3/Size_3", "op": "Size", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Range_3/Range_3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_8/Reshape_8", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Range_2/Range_2", "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_8/Reshape_8/shape"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Size_2/Size_2", "op": "Size", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Range_2/Range_2"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_5/Reshape_5", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/conv2d_9/BiasAdd", "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_5/shape/Reshape_5/shape"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Shape/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_1/conv2d_12/BiasAdd"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_packed_1/packed_1", "op": "Pack", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Size_3/Size_3", "StatefulPartitionedCall/functional_1/tf_op_layer_Size_2/Size_2"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_split_1/split_1", "op": "SplitV", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_5/Reshape_5", "StatefulPartitionedCall/functional_1/tf_op_layer_split_1/split_1/size_splits", "StatefulPartitionedCall/functional_1/tf_op_layer_split_1/split_1/split_dim"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}, "Tlen": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Shape/Shape", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice/begin", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice/end", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice/strides"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Shape/Shape", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1/begin", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1/end", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1/strides"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Fill_1/Fill_1", "op": "Fill", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_packed_1/packed_1", "StatefulPartitionedCall/functional_1/tf_op_layer_Fill_1/Fill_1/value"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Sigmoid_3/Sigmoid_3", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_split_1/split_1"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Exp_1/Exp_1", "op": "Exp", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_split_1/split_1:1"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Sigmoid_4/Sigmoid_4", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_split_1/split_1:2"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Sigmoid_5/Sigmoid_5", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_split_1/split_1:3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Tile/multiples/Tile/multiples", "op": "Pack", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice", "StatefulPartitionedCall/functional_1/tf_op_layer_Tile/multiples/Tile/multiples/1", "StatefulPartitionedCall/functional_1/tf_op_layer_Tile/multiples/Tile/multiples/2", "StatefulPartitionedCall/functional_1/tf_op_layer_Tile/multiples/Tile/multiples/3", "StatefulPartitionedCall/functional_1/tf_op_layer_Tile/multiples/Tile/multiples/4"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape/shape/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1", "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape/shape/Reshape/shape/3", "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape/shape/Reshape/shape/4"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Range_1/Range_1", "op": "Range", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Range_1/Range_1/start", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1", "StatefulPartitionedCall/functional_1/tf_op_layer_Range_1/Range_1/delta"], "attr": {"_cloned": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Range/Range", "op": "Range", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Range/Range/start", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1", "StatefulPartitionedCall/functional_1/tf_op_layer_Range/Range/delta"], "attr": {"_cloned": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_5/Mul_5", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_8/Reshape_8", "StatefulPartitionedCall/functional_1/tf_op_layer_Fill_1/Fill_1"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_6/Mul_6", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_9/Reshape_9", "StatefulPartitionedCall/functional_1/tf_op_layer_Fill_1/Fill_1"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_9/Mul_9", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Exp_1/Exp_1", "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_8/Mul_8"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/conv2d_12/BiasAdd", "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape/shape/Reshape/shape"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_4/Reshape_4", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Range_1/Range_1", "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_4/Reshape_4/shape"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Size_1/Size_1", "op": "Size", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Range_1/Range_1"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_3/Reshape_3", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Range/Range", "StatefulPartitionedCall/functional_1/tf_op_layer_Reshape_3/Reshape_3/shape"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Size/Size", "op": "Size", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Range/Range"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_stack_1/stack_1", "op": "Pack", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Mul_5/Mul_5", "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_6/Mul_6"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "axis": {"i": "-1"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_split/split", "op": "SplitV", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Reshape/Reshape", "StatefulPartitionedCall/functional_1/tf_op_layer_split/split/size_splits", "StatefulPartitionedCall/functional_1/tf_op_layer_split/split/split_dim"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}, "Tlen": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_packed/packed", "op": "Pack", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Size_1/Size_1", "StatefulPartitionedCall/functional_1/tf_op_layer_Size/Size"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_ExpandDims_2/ExpandDims_2", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_stack_1/stack_1", "StatefulPartitionedCall/functional_1/tf_op_layer_ExpandDims_2/ExpandDims_2/dim"], "attr": {"_cloned": {"b": true}, "Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Sigmoid/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_split/split"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Exp/Exp", "op": "Exp", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_split/split:1"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Sigmoid_1/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_split/split:2"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Sigmoid_2/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_split/split:3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Fill/Fill", "op": "Fill", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_packed/packed", "StatefulPartitionedCall/functional_1/tf_op_layer_Fill/Fill/value"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_ExpandDims_3/ExpandDims_3", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_ExpandDims_2/ExpandDims_2", "StatefulPartitionedCall/functional_1/tf_op_layer_ExpandDims_3/ExpandDims_3/dim"], "attr": {"_cloned": 